In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([21,12,23,34,45,56,68])
df

    0
0  21
1  12
2  23
3  34
4  45
5  56
6  68

In [3]:
df = pd.DataFrame([[21,12,23,20],[34,45,56,68],[1,2,3,4]])
df

    0   1   2   3
0  21  12  23  20
1  34  45  56  68
2   1   2   3   4

In [4]:
df = pd.DataFrame([[21,12,23,20],[34,45,56,68],[1,2,3,4]],columns=['a','b','c','d'],index=['x','y','z'])
df

    a   b   c   d
x  21  12  23  20
y  34  45  56  68
z   1   2   3   4

In [8]:
df1 = pd.DataFrame({'name':['Mehak','Mansi','Muskan','Meena','Neelam','Rinky','Sakshi','Roop'],
                     'class':['b.tech','mca','bba','b.com','llb','m.tech','bca','mca'],
                    'rollno':[12,13,34,42,25,36,78,89]})
df1

     name   class  rollno
0   Mehak  b.tech      12
1   Mansi     mca      13
2  Muskan     bba      34
3   Meena   b.com      42
4  Neelam     llb      25
5   Rinky  m.tech      36
6  Sakshi     bca      78
7    Roop     mca      89

In [9]:
df1.head() # first five rows-by default 5

     name   class  rollno
0   Mehak  b.tech      12
1   Mansi     mca      13
2  Muskan     bba      34
3   Meena   b.com      42
4  Neelam     llb      25

In [10]:
df1.head(3)

     name   class  rollno
0   Mehak  b.tech      12
1   Mansi     mca      13
2  Muskan     bba      34

In [11]:
df1.tail()

     name   class  rollno
3   Meena   b.com      42
4  Neelam     llb      25
5   Rinky  m.tech      36
6  Sakshi     bca      78
7    Roop     mca      89

In [12]:
df1.tail(3)

     name   class  rollno
5   Rinky  m.tech      36
6  Sakshi     bca      78
7    Roop     mca      89

In [13]:
# access- [], ., loc,iloc
df1['name']

0     Mehak
1     Mansi
2    Muskan
3     Meena
4    Neelam
5     Rinky
6    Sakshi
7      Roop
Name: name, dtype: object

In [14]:
df1.name

0     Mehak
1     Mansi
2    Muskan
3     Meena
4    Neelam
5     Rinky
6    Sakshi
7      Roop
Name: name, dtype: object

In [15]:
df1[: 3]

     name   class  rollno
0   Mehak  b.tech      12
1   Mansi     mca      13
2  Muskan     bba      34

In [16]:
df1['name'][1:4]

1     Mansi
2    Muskan
3     Meena
Name: name, dtype: object

In [17]:
df1.name[:5]

0     Mehak
1     Mansi
2    Muskan
3     Meena
4    Neelam
Name: name, dtype: object

In [18]:
df1[['name','rollno','class']]

     name  rollno   class
0   Mehak      12  b.tech
1   Mansi      13     mca
2  Muskan      34     bba
3   Meena      42   b.com
4  Neelam      25     llb
5   Rinky      36  m.tech
6  Sakshi      78     bca
7    Roop      89     mca

In [19]:
df1.rollno

0    12
1    13
2    34
3    42
4    25
5    36
6    78
7    89
Name: rollno, dtype: int64

In [20]:
# loc,iloc
df1.loc[:,:] # rows,columns

     name   class  rollno
0   Mehak  b.tech      12
1   Mansi     mca      13
2  Muskan     bba      34
3   Meena   b.com      42
4  Neelam     llb      25
5   Rinky  m.tech      36
6  Sakshi     bca      78
7    Roop     mca      89

In [22]:
df1.loc[:4,:]

     name   class  rollno
0   Mehak  b.tech      12
1   Mansi     mca      13
2  Muskan     bba      34
3   Meena   b.com      42
4  Neelam     llb      25

In [23]:
df1.iloc[:4,:]

     name   class  rollno
0   Mehak  b.tech      12
1   Mansi     mca      13
2  Muskan     bba      34
3   Meena   b.com      42

In [24]:
df1.loc[:4,'name']

0     Mehak
1     Mansi
2    Muskan
3     Meena
4    Neelam
Name: name, dtype: object

In [25]:
df1.loc[:4,['class','name']]

    class    name
0  b.tech   Mehak
1     mca   Mansi
2     bba  Muskan
3   b.com   Meena
4     llb  Neelam

In [26]:
df1.iloc[:,2]

0    12
1    13
2    34
3    42
4    25
5    36
6    78
7    89
Name: rollno, dtype: int64

In [27]:
df1.iloc[:]

     name   class  rollno
0   Mehak  b.tech      12
1   Mansi     mca      13
2  Muskan     bba      34
3   Meena   b.com      42
4  Neelam     llb      25
5   Rinky  m.tech      36
6  Sakshi     bca      78
7    Roop     mca      89

In [28]:
df1.iloc[:,1]

0    b.tech
1       mca
2       bba
3     b.com
4       llb
5    m.tech
6       bca
7       mca
Name: class, dtype: object

In [29]:
df1.shape

(8, 3)

In [34]:
# add column
df1.loc[:,'Total marks'] = 50
df1

     name   class  rollno  Total marks  marks
0   Mehak  b.tech      12           50     50
1   Mansi     mca      13           50     23
2  Muskan     bba      34           50     44
3   Meena   b.com      42           50     66
4  Neelam     llb      25           50     78
5   Rinky  m.tech      36           50     90
6  Sakshi     bca      78           50     11
7    Roop     mca      89           50     23

In [35]:
# add column
df1.loc[:,'marks'] = [50,23,44,66,78,90,11,23]
df1

     name   class  rollno  Total marks  marks
0   Mehak  b.tech      12           50     50
1   Mansi     mca      13           50     23
2  Muskan     bba      34           50     44
3   Meena   b.com      42           50     66
4  Neelam     llb      25           50     78
5   Rinky  m.tech      36           50     90
6  Sakshi     bca      78           50     11
7    Roop     mca      89           50     23

In [37]:
df1.loc[4,'marks'] = 48
df1

     name   class  rollno  Total marks  marks
0   Mehak  b.tech      12           50     50
1   Mansi     mca      13           50     23
2  Muskan     bba      34           50     44
3   Meena   b.com      42           50     66
4  Neelam     llb      25           50     48
5   Rinky  m.tech      36           50     90
6  Sakshi     bca      78           50     11
7    Roop     mca      89           50     23

In [39]:
df1.loc[:,'Total marks'] = 70
df1

     name   class  rollno  Total marks  marks
0   Mehak  b.tech      12           70     50
1   Mansi     mca      13           70     23
2  Muskan     bba      34           70     44
3   Meena   b.com      42           70     66
4  Neelam     llb      25           70     48
5   Rinky  m.tech      36           70     90
6  Sakshi     bca      78           70     11
7    Roop     mca      89           70     23

In [42]:
df1.loc[8,:]=['Naina','m.com',33,71,89]
df1

     name   class  rollno  Total marks  marks
0   Mehak  b.tech    12.0         70.0   50.0
1   Mansi     mca    13.0         70.0   23.0
2  Muskan     bba    34.0         70.0   44.0
3   Meena   b.com    42.0         70.0   66.0
4  Neelam     llb    25.0         70.0   48.0
5   Rinky  m.tech    36.0         70.0   90.0
6  Sakshi     bca    78.0         70.0   11.0
7    Roop     mca    89.0         70.0   23.0
8   Naina   m.com    33.0         71.0   89.0

In [43]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         9 non-null      object
 1   class        9 non-null      object
 2   rollno       9 non-null      float64
 3   Total marks  9 non-null      float64
 4   marks        9 non-null      float64
dtypes: float64(3), object(2)
memory usage: 492.0+ bytes

In [44]:
df1.insert(3,column = 'New',value = 1)
df1

     name   class  rollno  New  Total marks  marks
0   Mehak  b.tech    12.0    1         70.0   50.0
1   Mansi     mca    13.0    1         70.0   23.0
2  Muskan     bba    34.0    1         70.0   44.0
3   Meena   b.com    42.0    1         70.0   66.0
4  Neelam     llb    25.0    1         70.0   48.0
5   Rinky  m.tech    36.0    1         70.0   90.0
6  Sakshi     bca    78.0    1         70.0   11.0
7    Roop     mca    89.0    1         70.0   23.0
8   Naina   m.com    33.0    1         71.0   89.0